/* Project:      NewGame
 * File Name:    GlobalVariable.h
 * Author:       Atlas Shen
 * Date:         2017/4/17
 * Purpose:      全局变量头文件
 */

#pragma once

#include <fstream>
#include "AEEngine.h"
#include "System.h"
#include "Input.h"
#include "GameStateManager.h"

//------------------------------------------------------------------------------
// Typedef:
//------------------------------------------------------------------------------

//------------------------------------------------------------------------------
// Public Consts:
//------------------------------------------------------------------------------

//------------------------------------------------------------------------------
// Public Structures:
//------------------------------------------------------------------------------

//------------------------------------------------------------------------------
// Public Classes:
//------------------------------------------------------------------------------

//------------------------------------------------------------------------------
// Public Variables:
//------------------------------------------------------------------------------
ofstream System::log_file_;
AESysInitInfo System::sys_init_info_;
streambuf* System::streambuf_pointer_;
ofstream System::console_out_;

bool Input::key_pressed_[NUM_OF_KEY];

GameState* GameStateManager::game_state_[NUM_OF_GAME_STATES];
GameState** GameStateManager::game_state_pointer_;

//------------------------------------------------------------------------------
// Public Functions:
//------------------------------------------------------------------------------
